app/controllers/administradors_controller.rb

  def index
    @administradors = Administrador.all
---
SELECT "administradors".* FROM "administradors"

  def create
    @administrador = Administrador.new(administrador_params)

    respond_to do |format|
      if @administrador.save
---
INSERT INTO "administradors" ("login", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "Pirangaba"], ["senha", "admin"], ["created_at", "2019-11-27 08:43:16.899607"], ["updated_at", "2019-11-27 08:43:16.899607"]]

  def destroy
    @administrador.destroy
---
DELETE FROM "administradors" WHERE "administradors"."id" = ?  [["id", 980190962]]

    def set_administrador
      @administrador = Administrador.find(params[:id])
---
SELECT  "administradors".* FROM "administradors" WHERE "administradors"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]